<title><?php echo "24 Сунагатов Ильгиз  ПИ-321"; ?></title>
<p> Выполнил Сунагатов Ильгиз <br />  Вариант№4 <br /> Задача№4 :
<p> 
<?php
$A=array();
$A1=array();
$n=rand(0,100);

for ($i = 1; $i <= $n; $i++) {    
     $A[$i-1]=rand(-100,100);
     echo $A[$i-1] . " ";
}
echo "<br> <br>";
$y=0;
foreach($A as $n){
    if($n > 0){
        $y++;
    }else{
        $A1[] = $y;
        $y = 0;
    }
}

echo 'Максимальное количество подряд идущих положительных элементов - ' . max($A1);

?>
	$b=$b+1;
} else {
	$c=$c+1;
}

}

echo "Чисел больше ".$S." - ".$a."<br />";
echo "Чисел меньше ".$S." - ".$c."<br />";
echo "Чисел равных ".$S." - ".$b."<br />";
?>